---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceLoadData
source: html/78afa228-3a5a-c69e-aba5-010f42d3a1cf.htm
---
# ExternalResourceLoadData Methods

Returns the ExternalResourceReference that identifies which resource should be loaded.